Repository: K227-arch/Rasberry-model
Catalog: runyoro_nmt/data/tm/runyoro_en.tmx
Source language: nyk
Languages: en

source: buhya
en: [GENERAL_NOUN] pitfall for animals

source: buhyaka
en: [GENERAL_NOUN] newness

source: bujagaali
en: [GENERAL_NOUN] stupidity

source: bujojo
en: [GENERAL_NOUN] elephantiasis

source: bujonjo
en: [GENERAL_NOUN] secretion of the eyes

source: bujulizi
en: [LEGAL_AND_LAW_MATTERS_NOUN] evidence, testimony

source: bujunaanizibwa
en: [GENERAL_NOUN] responsibility

source: bujune
en: [GENERAL_NOUN] sorrow, trouble, misery, melancholy

source: bujwahi
en: [GENERAL_NOUN] weariness, fatigue

source: Bukama
en: [GOVERNANCE_AND_ADMINISTRATION_NOUN] Kingdom

source: bukanga
en: [GENERAL_ADV] at a high price

source: bukatuzi
en: [GENERAL_NOUN] violence

source: bukaya
en: [GENERAL_NOUN] fierceness

source: bukazi
en: [GENERAL_NOUN] womanhood,female genitals

source: buke
en: [GENERAL_NOUN] littleness, fewness

source: bukeeto
en: [GENERAL_NOUN] stewardship

source: bukene
en: [GENERAL_NOUN] die uncared for

source: bukerembe
en: [GENERAL_NOUN] infancy

source: bukigi
en: [GENERAL_NOUN] trypanosomyasis

source: bukiioiiki
en: [GENERAL_NOUN] sarcasm

source: bukiiouuki
en: [GENERAL_NOUN] rudeness

source: bukoonyezi
en: [GENERAL_NOUN] help,assistance

source: bukooto
en: [GENERAL_NOUN] size,bigness

source: Bukristaayo
en: [GENERAL_NOUN] Christianity

source: bukuku
en: [GENERAL_NOUN] stinginess,rancidity

source: bukungani
en: [GENERAL_NOUN] discord, strife

source: bukungu
en: [GENERAL_NOUN] minor chieftainship

source: bukorungutaniza
en: [GENERAL_NOUN] cunnningness, craftiness

source: bukwasizo/buyamba
en: [GENERAL_NOUN] assistance,support

source: bukwataoe
en: [GENERAL_NOUN] relationship

source: bukwatwa
en: [GENERAL_NOUN] captivity,imprisonment

source: bukwenda
en: [GENERAL_NOUN] deputed authority, ambassadorship, ministry,commission

source: bukyabukya
en: [GENERAL_NOUN] daily, always

source: Buraya
en: [GENERAL_NOUN] Europe

source: bulebule
en: [GENERAL_NOUN] completely

source: buleegi
en: [GENERAL_NOUN] begging

source: bulehe
en: [GENERAL_NOUN] compensation,reparation

source: bulemeezi
en: [GENERAL_NOUN] weight,difficulty

source: bulemi
en: [GENERAL_NOUN] rule, control,government, force

source: bulemu
en: [MILITARY_NOUN] war, battle, struggle, conflict

source: bulengerezi
en: [GENERAL_NOUN] careful measurement (of food)

source: bulengi
en: [GENERAL_NOUN] stinginess

source: yamba abaana
en: [GENERAL_NOUN] care of children

source: burryegaitaho
en: [COMMON_ANIMALS_NOUN] join

source: buliba
en: [COMMON_ANIMALS_NOUN] rat trap

source: bulibweoguzi
en: [GENERAL_NOUN] corruption

source: buliiririzi
en: [GENERAL_NOUN] greed

source: buliro
en: [GENERAL_NOUN] source of foodsupply, pasture

source: buliisa
en: [GENERAL_NOUN] work of ashepherd; pastorate

source: burlisizo
en: [GENERAL_NOUN] pasture

source: bulimi
en: [GENERAL_NOUN] lisp

source: bulindwa
en: [GENERAL_NOUN] protection

source: bulingiri
en: [GENERAL_NOUN] unsociability

source: bulinzi
en: [GENERAL_NOUN] guardianship

source: buryo
en: [GENERAL_NOUN] justice, reason

source: bumanyi
en: [GENERAL_NOUN] knowledge,understand recognition

source: bumanyiizi
en: [GENERAL_NOUN] experience

source: bumanzi
en: [GENERAL_NOUN] courage

source: butwa
en: [GENERAL_NOUN] poison

source: bumba
en: [GENERAL_NOUN] mould

source: bumbaataniza
en: [GENERAL_VERB] to clasp, tightly

source: bumbaatira
en: [GENERAL_VERB] to gather under wings

source: bumbaatiza
en: [GENERAL_VERB] to clasp tightly

source: bumburu
en: [BIOLOGY_NOUN] species of beer banana

source: bumbu ruka
en: [GENERAL_VERB] to emerge from undenvate

source: bumomi
en: [GENERAL_NOUN] rust

source: byomu
en: [GENERAL_NOUN] oneness, unity

source: bumwemwe
en: [GENERAL_NOUN] smile

source: bunabbi
en: [GENERAL_NOUN] prophecy

source: bunaku
en: [GENERAL_NOUN] poverty

source: bunanasi
en: [GENERAL_NOUN] redness

source: bunanu
en: [GENERAL_NOUN] trustfulness,confidence

source: bunanuki
en: [GENERAL_NOUN] foreg

source: bunda arra
en: [GENERAL_NOUN] tolie in wait, for

source: bundaaza
en: [GENERAL_VERB] to humble, abase

source: bundiika
en: [GENERAL_VERB] to press down, squash

source: bune
en: [GENERAL_NOUN] liver

source: Bungereza
en: [GENERAL_NOUN] England

source: bungurya
en: [GENERAL_NOUN] gulp

source: bunihe
en: [GENERAL_NOUN] satisfaction,repletion

source: bunkohoob
en: [GENERAL_NOUN] inedible termites

source: bunkuli
en: [GENERAL_NOUN] bolt food, gulp

source: bunoobi
en: [GENERAL_NOUN] hatred

source: buntamantama
en: [GENERAL_NOUN] mumble, mutter, murmur

source: buotu
en: [GENERAL_NOUN] being, humanity

source: bunu
en: [GENERAL_NOUN] this

source: bunuliirizi
en: [GENERAL_NOUN] sweetness

source: bunuzi
en: [GENERAL_NOUN] flavor, taste

source: bunwekinweki
en: [GENERAL_NOUN] flattery

source: bunyaata
en: [GENERAL_NOUN] eating without a relish

source: bunyagi
en: [GENERAL_NOUN] plunder, violence, rapine

source: bunyagwa
en: [GENERAL_NOUN] captivity

source: buoyakantu
en: [GENERAL_NOUN] hasty,temper

source: bunyamarumbu
en: [GENERAL_NOUN] stiffness, aching

source: bunyamibwa
en: [GENERAL_NOUN] good looks

source: bunyankomo
en: [GENERAL_NOUN] imprisonment

source: bunyansi
en: [GENERAL_NOUN] grass

source: bunyanzigwa
en: [GENERAL_NOUN] enemity

source: bunyaruguru
en: [GENERAL_NOUN] position

source: bunyeete
en: [GENERAL_NOUN] stoutness

source: bunyigi
en: [GENERAL_NOUN] meanness,stinginess, miserliness

source: bunyuunyuguzi
en: [GENERAL_NOUN] foreg

source: bunywani
en: [GENERAL_NOUN] friendship, blood brother-hood

source: bunyigitiro
en: [GENERAL_NOUN] foreg

source: bunyuunyambuzi
en: [GENERAL_NOUN] plant like clover

source: bunyu unyuguru,
en: [GENERAL_NOUN] tickling sensation

source: buraara
en: [GENERAL_NOUN] plant withhairy stinging leaves

source: buraaro
en: [GENERAL_NOUN] lodging

source: burabo
en: [GENERAL_NOUN] path, passage,way

source: buraguzi
en: [GENERAL_NOUN] divination

source: buraiha
en: [GENERAL_NOUN] height

source: buraira
en: [GENERAL_NOUN] length, height

source: bugumya
en: [GENERAL_NOUN] fixed, firmly

source: burangara
en: [GENERAL_NOUN] stir up trouble

source: burangura
en: [HEALTH_AND_MEDICINE_NOUN] opthalmia,trachoma

source: buro
en: [GENERAL_NOUN] small millet

source: burofu
en: [GENERAL_NOUN] filth., dirtiness,slovenness

source: bu rogo
en: [CULTURE_AND_TRADITION_NOUN] witchcraft

source: buronde
en: [GENERAL_NOUN] forced labour

source: burubatiro
en: [GENERAL_NOUN] tread of foot, sole

source: burugo
en: [GENERAL_NOUN] place of origin

source: buruguta
en: [GENERAL_NOUN] roar, sound

source: burukwera
en: [GENERAL_NOUN] holiness

source: burumi
en: [GENERAL_NOUN] ache, pain

source: burumuka
en: [GENERAL_VERB] to rustle, swish

source: burundu
en: [HEALTH_AND_MEDICINE_NOUN] smallpox

source: burungi
en: [GENERAL_NOUN] beauty, goodness

source: burungurungu
en: [GENERAL_NOUN] alone

source: burungutana
en: [GENERAL_VERB] to bustle about, hustle

source: bururumi
en: [GENERAL_NOUN] fierceness,ferocity, harshness

source: buruutura
en: [GENERAL_NOUN] rip, tear

source: burwa
en: [COMMON_ANIMALS_NOUN] ashes of burnt cow-dung

source: burwaire
en: [GENERAL_NOUN] illness, sickness, disease

source: busumi
en: [GENERAL_NOUN] time

source: busumiikiranizo
en: [GENERAL_NOUN] fastening. Joint

source: busuubuzi
en: [GENERAL_NOUN] trade

source: busuuhuuki
en: [GEOGRAPHY_NOUN] exile, emigration

source: buswale
en: [GENERAL_NOUN] raffia

source: busuuru
en: [GENERAL_NOUN] ground-rent

source: busuuti
en: [GENERAL_NOUN] Arab robe

source: buswagirizi
en: [GENERAL_NOUN] flattery

source: buswahirizi
en: [GENERAL_NOUN] provocation, taunting, booing

source: buta
en: [GENERAL_VERB] be feeble

source: butaahi
en: [GENERAL_NOUN] neighbourhood,neighbourliness

source: butaaho
en: [GENERAL_NOUN] residence, dwelling place

source: butaamanya
en: [GENERAL_NOUN] foolishness

source: butagali
en: [GENERAL_NOUN] weakness,thinness of the legs

source: butagasi
en: [GENERAL_NOUN] warmth

source: butaweza
en: [GENERAL_NOUN] blindness

source: butaikya
en: [GENERAL_NOUN] unceasingly

source: bu taito,
en: [GENERAL_NOUN] littleness.smallness, fewness

source: butale
en: [GENERAL_NOUN] iron ore

source: butamilzi
en: [GENERAL_NOUN] drunkenness, intoxication

source: butandikiro
en: [GENERAL_NOUN] starting point

source: butandwa
en: [GENERAL_NOUN] unforeseen peril, accident

source: butanwa
en: [GENERAL_NOUN] accidental occurrence

source: butasi
en: [GENERAL_NOUN] espionage

source: butatara
en: [GENERAL_VERB] to spread about

source: butebezi
en: [GENERAL_NOUN] preaching

source: buteeraniro
en: [GENERAL_NOUN] joint

source: buteero
en: [GENERAL_VERB] to fall

source: buteerre
en: [GENERAL_NOUN] slipperiness

source: butembane
en: [GENERAL_NOUN] inbreeding

source: butende
en: [CULTURE_AND_TRADITION_NOUN] initiation ceremony of diviner

source: buteodebeki
en: [GENERAL_NOUN] task

source: butentebeke
en: [GENERAL_NOUN] impossibility, difficulty

source: butere
en: [GENERAL_NOUN] fat tai

source: butida
en: [GENERAL_NOUN] catapult

source: butigi
en: [GENERAL_NOUN] forwardness, perversity

source: butiime
en: [GENERAL_NOUN] minced meat

source: butiini
en: [GENERAL_NOUN] fear, cowardice

source: butika
en: [GENERAL_VERB] to dump down

source: buto
en: [GENERAL_NOUN] childhood,youth

source: butogoro
en: [GENERAL_NOUN] bloodpudding

source: butooganiro
en: [GENERAL_NOUN] excuse, defence

source: botumwa
en: [GENERAL_NOUN] conunission,apostleship, ministry

source: buturumuki
en: [GENERAL_NOUN] sloth,slackness

source: butungi
en: [GENERAL_NOUN] wealth

source: buturukaizooba
en: [GENERAL_NOUN] the East

source: butuzi
en: [GENERAL_NOUN] button mushrooms

source: butweke
en: [HEALTH_AND_MEDICINE_NOUN] pregnancy of unmarried woman

source: butweki
en: [GENERAL_NOUN] fomication(male)

source: buura
en: [GENERAL_NOUN] give warning

source: buurra/ zubura
en: [GENERAL_NOUN] open the eyes

source: buurru
en: [GENERAL_NOUN] cloud of dust

source: buuta
en: [GENERAL_NOUN] very feeble person; idiot

source: buutabu
en: [GENERAL_NOUN] stoop

source: buutikira
en: [GENERAL_VERB] to smother, cover up

source: buya
en: [GENERAL_VERB] to be sleepless

source: buyambi
en: [GENERAL_NOUN] help, aid,assistance

source: buyanja
en: [GENERAL_NOUN] wavelets, ripples

source: buyondo
en: [GENERAL_NOUN] twisted fringe

source: buyungiro
en: [GENERAL_NOUN] joint, splice

source: buza
en: [GENERAL_NOUN] lose

source: buzaale
en: [GENERAL_NOUN] clanship, relationship, kinship

source: buzaana
en: [GENERAL_NOUN] slavery

source: buzaarwa
en: [GENERAL_NOUN] parentage, birthplace

source: buzigu
en: [HEALTH_AND_MEDICINE_NOUN] hostility,enemity; smallpox

source: buzimba
en: [HEALTH_AND_MEDICINE_NOUN] tuberculosis

source: buzimbira
en: [GENERAL_NOUN] bulk

source: buzindaazi
en: [GENERAL_NOUN] hoarseness

source: bwabwanura
en: [GENERAL_VERB] to crunch

source: bwagaarra
en: [GENERAL_VERB] to be squashed

source: bwagura
en: [COMMON_ANIMALS_VERB] to bear (puppy, cubs)

source: bwahuzi
en: [GENERAL_NOUN] storing up,stewardship

source: bwakabiri
en: [GENERAL_NOUN] second time

source: bwakaiso
en: [LEGAL_AND_LAW_MATTERS_NOUN] witness,testimony, evidence

source: bwakyo
en: [GENERAL_NOUN] tinny flowers

source: bwalingi
en: [GENERAL_NOUN] laziness,foolishness

source: bwamata
en: [GENERAL_NOUN] tonsils

source: bwamba
en: [GENERAL_NOUN] copious

source: bwanda
en: [GENERAL_NOUN] yellow stonecrop

source: bwanga
en: [GENERAL_NOUN] hollows

source: bwangi
en: [GENERAL_NOUN] refusal

source: bwanyakatagara
en: [GENERAL_NOUN] priesthood

source: bwarabwara
en: [GENERAL_VERB] to crouch down, hide

source: bwarangasa
en: [GENERAL_NOUN] atmosphere

source: bwarubanga
en: [GENERAL_NOUN] godhead

source: bwate
en: [GENERAL_NOUN] jealousy

source: bwati
en: [HEALTH_AND_MEDICINE_NOUN] fissures of childbirth

source: bwatuka
en: [GENERAL_VERB] to make noise

source: bweculiko
en: [GENERAL_NOUN] slope

source: bwecumi
en: [GENERAL_NOUN] neatness,smartness, cleanliness, adornment

source: bweewiso
en: [GENERAL_NOUN] expiation

source: bweganyi
en: [GENERAL_NOUN] self-pity

source: bweganyirizi
en: [GENERAL_NOUN] slackness, laziness

source: bwegege
en: [GENERAL_NOUN] carefully

source: bwegendereza
en: [GENERAL_NOUN] carefulness, circumspection, thrift

source: bwegesa
en: [GENERAL_NOUN] teaching

source: bwegesibwa
en: [GENERAL_NOUN] civilization

source: bwcgombi
en: [GENERAL_NOUN] covetousness

source: bwebinduurro
en: [GENERAL_NOUN] room to tum, freedom

source: bwekambi
en: [GENERAL_NOUN] deligeocc, zeal, earnestness, zest

source: bwckanasi
en: [GENERAL_NOUN] laziness, indolence

source: bwekiiko
en: [GENERAL_NOUN] bend, curve,tum

source: bwckobi
en: [GENERAL_NOUN] conspiracy

source: bwekubizo
en: [GENERAL_NOUN] careful up bringing, petting

source: bwekuniki
en: [GENERAL_NOUN], conceit, showing off

source: bwenda
en: [GENERAL_NOUN] generosity,liberality, bounty

source: bwenderezi
en: [GENERAL_NOUN] oppression,bullying

source: bwenugi
en: [GENERAL_NOUN] neglect of owcrcowcre

source: bwerebwere
en: [GENERAL_NOUN] openly

source: bwereme
en: [GENERAL_NOUN] willfulness,rebellion, impudence

source: bweremera
en: [GENERAL_NOUN] sole ownership

source: bwerengerezi
en: [GENERAL_NOUN] bullying, scornfulness

source: bwerindwa
en: [GENERAL_NOUN] fragility

source: bwesaganirizo
en: [GENERAL_NOUN] rustling

source: bwesengeze
en: [GENERAL_NOUN] leasehold land

source: bwesereko
en: [GENERAL_NOUN] hiding place, refuge

source: bwesige
en: [GENERAL_NOUN] trust,confidence, assurance

source: bwesigwa
en: [GENERAL_NOUN] trustworthiness, faithfulness

source: bwesumbo
en: [GENERAL_NOUN] shelter from rain

source: bwesumikiri
en: [GENERAL_NOUN] lumps

source: bwesungi
en: [GENERAL_NOUN] cheek, impudence, naughtiness

source: bwezigooro
en: [GENERAL_NOUN] curve,bend, round about

source: bwibi/busuma
en: [GENERAL_NOUN] theft

source: bwigamiro/ buyamba
en: [GENERAL_NOUN] support

source: bwigamo
en: [GENERAL_NOUN] shelter

source: Bwigara
en: [GENERAL_INTERJ] expression of pity

source: bwigara
en: [HEALTH_AND_MEDICINE_NOUN] smallpox

source: bwigurumba
en: [GENERAL_NOUN] bigness

source: bwiguu
en: [GENERAL_NOUN] bully

source: bwihulebwona
en: [COMMON_ANIMALS_NOUN] stinging centipede

source: bwijukuru
en: [GENERAL_NOUN] ancestry,generations

source: bwikaro
en: [GENERAL_NOUN] place, residence, abode

source: bwikazi
en: [GENERAL_NOUN] foreg

source: bwikizo
en: [GENERAL_NOUN] refuge

source: bwiko
en: [GENERAL_NOUN] mutual hatred,enmity

source: Bwikya
en: [GENERAL_NOUN] house of thequeen consort

source: bwimi
en: [GENERAL_NOUN] meanness,stinginess

source: bwina
en: [GENERAL_NOUN] linleholes, tunnels

source: bwinazi
en: [GENERAL_NOUN] poverty

source: bwingi
en: [GENERAL_NOUN] plenty

source: bwingira
en: [GENERAL_NOUN] cave. Den

source: bwinike
en: [GENERAL_NOUN] serfdom

source: bwiru
en: [GENERAL_NOUN] slavery

source: bwirukiro
en: [GENERAL_NOUN] place of refuge, retreat

source: bwisi
en: [GENERAL_NOUN] murder

source: bwisiki
en: [GENERAL_NOUN] girlhood

source: bwogi
en: [GENERAL_NOUN] sharpness, edge

source: bwogo
en: [GENERAL_NOUN] tumult, uproar

source: bwojo
en: [GENERAL_NOUN] boyhood

source: bwoki
en: [GENERAL_NOUN] honey

source: bwomangane
en: [GENERAL_NOUN] toughness

source: bwomeezi
en: [GENERAL_NOUN] health, life, soul

source: bwomi
en: [GENERAL_NOUN] dryness

source: bwomere
en: [GENERAL_NOUN] dryness

source: bwomuntu
en: [GENERAL_NOUN] humanity

source: bwongo
en: [GENERAL_NOUN] brain

source: bwonjooka
en: [GENERAL_VERB] to go away stealthily

source: bworobi
en: [GENERAL_NOUN] softness, tenderness

source: bworoozi
en: [GENERAL_NOUN] guardianshjp

source: bwotere
en: [GENERAL_NOUN] butter mixed with perfume

source: bwoya
en: [GENERAL_NOUN] hair

source: bwoyooyo
en: [GENERAL_NOUN] nothing at all

source: byahi
en: [GENERAL_NOUN] skin mats, child's bedding

source: byakeeri
en: [GENERAL_NOUN] hair in the annat

source: byamba/buroofu
en: [GENERAL_NOUN] dirt

source: byaoa
en: [GENERAL_NOUN] fruit, offspring

source: byara
en: [GENERAL_NOUN] fingers

source: byeoda
en: [GENERAL_NOUN] entrails

source: byenga
en: [GENERAL_NOUN] slag of iron, dross

source: byeyererwa
en: [GENERAL_VERB] find no one in

source: byobwomeezi
en: [GENERAL_NOUN] health,sanitation matters

source: byokera
en: [GENERAL_VERB] to attack

source: byokurya
en: [GENERAL_NOUN] food

source: byorwaoju
en: [GENERAL_NOUN] immorality

source: byoya
en: [GENERAL_NOUN] feathers,fur(animal hair)

source: banu
en: [GENERAL_NOUN] these ones

source: bandwa
en: [GENERAL_NOUN] chwezi priests

source: baro
en: [GENERAL_NOUN] your husband

source: basemera
en: [GENERAL_NOUN] he/she is good looking

source: basingo
en: [GENERAL_NOUN] courtier or fort-dweller, attendant

source: batembuzi
en: [GENERAL_NOUN] pioneers, harbigners

source: bazaire
en: [GENERAL_NOUN] parents

source: bazarrabusa
en: [GENERAL_NOUN] they produce[children] for nothing

source: bbaasi!
en: [GENERAL_NOUN] enough

source: bbaibbuli
en: [GENERAL_NOUN] bible

source: bbasitoora
en: [GENERAL_NOUN] pistol

source: bbogoya
en: [GENERAL_NOUN] plantain

source: bbwa
en: [GENERAL_NOUN] openly

source: beebwa
en: [GENERAL_NOUN] they can forget

source: biringi
en: [GENERAL_NOUN] sickle

source: bibiri
en: [GENERAL_NOUN] two hundred

source: bibiri n'emu
en: [GENERAL_NUM] two hundred and one

source: bibiri n'ikumi
en: [GENERAL_NUM] two hundred and ten

source: bigo
en: [GENERAL_NOUN] place, city

source: bikumi bibiri
en: [GENERAL_NOUN] two hundred

source: bikumi bina
en: [GENERAL_NOUN] four hundred

source: bikumi bisatu
en: [GENERAL_NOUN] three hundred

source: bikumi bitaano
en: [GENERAL_NOUN] five hundred

source: biizi-bitoosa
en: [COMMON_ANIMALS_NOUN] meat of a sheep

source: binkwatiireki
en: [GENERAL_NOUN] carelessly

source: binzaari
en: [GENERAL_NOUN] orange colour

source: binu
en: [GENERAL_NOUN] these ones

source: biisopu
en: [GENERAL_NOUN] bishop

source: bonka
en: [GENERAL_NOUN] they alone

source: bonsatu
en: [GENERAL_NOUN] three of them

source: bontaano
en: [GENERAL_NOUN] five of them

source: boojo
en: [GENERAL_NOUN] please

source: bbooda-booda
en: [TRANSPORT_NOUN] bicycle or motorcycle taxi

source: booma
en: [GENERAL_NOUN] government ground or station

source: boona
en: [GENERAL_NOUN] all of them

source: bucuzi
en: [GENERAL_NOUN] upside down

source: bugazi
en: [GENERAL_NOUN] facing up

source: bugingo
en: [GENERAL_NOUN] dangerous, deadly

source: bugubugu
en: [GENERAL_NOUN] quickly and carelessly

source: bugendandara
en: [GENERAL_VERB] to walk sluggishly

source: bugwaizooba
en: [GENERAL_NOUN] West

source: buheekwa
en: [GENERAL_NOUN] vehemence

source: bukiika
en: [GENERAL_NOUN] across

source: buli kiro
en: [GENERAL_NOUN] everyday

source: bundi
en: [GENERAL_NOUN] another time

source: burugaizooba
en: [GENERAL_NOUN] East

source: buturukamusanaj busa
en: [GENERAL_NOUN] for nothing

source: busi bwa nseeri
en: [GENERAL_ADV] on the opposite hills

source: businge
en: [GENERAL_NOUN] peacefully

source: butaleka
en: [GENERAL_NOUN] uncreasingly, continuously

source: butoosa
en: [GENERAL_NOUN] everyday, always

source: bujenjebere
en: [GENERAL_NOUN] something that is shaky

source: bujinja
en: [COMMON_ANIMALS_NOUN] a sheep without ears

source: bujumeera
en: [GENERAL_NOUN] a good singing voice

source: bumoso
en: [GENERAL_NOUN] left hand side

source: buri
en: [GENERAL_NOUN] that time

source: buso-bwa-ntaama
en: [GENERAL_NOUN] head on collision

source: bwa
en: [GENERAL_VERB] to speak openly

source: bwakeire-bwaizire
en: [GENERAL_NOUN] now and then

source: bwangu
en: [GENERAL_NOUN] quickly

source: bwanamukuru
en: [GENERAL_NOUN] a parish priest

source: bwanyima
en: [GENERAL_NOUN] afterwards; later

source: bwatu
en: [GENERAL_NOUN] doing something openly

source: bweera
en: [GENERAL_NOUN] open

source: bwemi
en: [GENERAL_NOUN] upright, standing up

source: bwereere
en: [GENERAL_NOUN] a very young baby

source: bwino
en: [GENERAL_NOUN] ink,written

source: bwo
en: [GENERAL_NOUN] it, itself, they, themselves

source: bwohe
en: [GENERAL_NOUN] temptation

source: byabazaire
en: [GENERAL_NOUN] of parents

source: byo
en: [GENERAL_NOUN] they, themselves

source: byona
en: [GENERAL_NOUN] all of them

source: kubunga buli kaire
en: [GENERAL_VERB] to be always visiting

source: caai
en: [GENERAL_NOUN] tea, tea leaves,tea plant

source: Caali
en: [GENERAL_NOUN] expresses pity, admiration

source: cambaitu
en: [GENERAL_VERB] to shake about, spill

source: candakaarra
en: [GENERAL_VERB] to be exhausted

source: kubonesa
en: [GENERAL_NOUN] torture

source: capa/kutera
en: [GENERAL_NOUN] slap

source: capuka
en: [GENERAL_VERB] to be chipped

source: capura/kucwa
en: [GENERAL_VERB] to chip, break off

source: ceba
en: [GENERAL_VERB] to pound, crush

source: cebaceba
en: [GENERAL_VERB] to trot

source: kusekereza
en: [GENERAL_VERB] to mock

source: ceeceeba
en: [GENERAL_NOUN] cebaceba

source: ceke
en: [GENERAL_NOUN] weak, feeble

source: cekeca
en: [GENERAL_VERB] to dance,leap

source: cwonacwona
en: [GENERAL_NOUN] completely

source: cekya
en: [GENERAL_VERB] to weaken

source: cencebuka
en: [GENERAL_VERB] to be tom, ragged

source: cencebura
en: [GENERAL_VERB] to tear into pieces

source: cenkacenka/nena
en: [GENERAL_VERB] to chew

source: cika
en: [GENERAL_NOUN] discuss thoroughly

source: cikinya
en: [GENERAL_VERB] be tidy, neat, quiet

source: cikinyiza
en: [GENERAL_VERB] to shake about, strew

source: compacompya
en: [GENERAL_VERB] to be deceitful

source: concoboza
en: [GENERAL_VERB] to become destitute

source: concona /kohonda
en: [GENERAL_VERB] to crush, pound

source: kubyama
en: [GENERAL_NOUN] sleep

source: cucu
en: [GENERAL_INTERJ] expression of fraight

source: cugura
en: [GENERAL_VERB] to have diarrhoea

source: Cukanaho
en: [GENERAL_NOUN] Get out

source: cukumura
en: [GENERAL_VERB] to discard

source: curiikana
en: [GENERAL_VERB] to over lap

source: kusindika
en: [GENERAL_VERB] to push

source: cumanga
en: [GENERAL_VERB] to push repeatedly, neglect

source: kwanga
en: [GENERAL_VERB] to refuse

source: cumba
en: [GENERAL_VERB] to cook, boil

source: cumbagira
en: [GENERAL_VERB] to limp

source: cumika
en: [GENERAL_VERB] to set fire

source: cumita
en: [GENERAL_VERB] to stab, spear, pierce

source: cuncumura
en: [GENERAL_VERB] to drive away, scareaway

source: cunduka
en: [GENERAL_VERB] be corpulent

source: cumuka
en: [GENERAL_VERB] to grow tall

source: cungura
en: [GENERAL_VERB] to buy back, redeem

source: cunkura
en: [GENERAL_VERB] to suck dry

source: cupa
en: [GENERAL_NOUN] bottle

source: ente ekuru,omukazi mukuru
en: [COMMON_ANIMALS_NOUN] old cow, old woman

source: curru
en: [GENERAL_NOUN] a destitute person

source: cuucu
en: [GENERAL_NOUN] dust

source: cuukun
en: [GENERAL_NOUN] wean

source: cwagura
en: [GENERAL_VERB] to eat ravenously

source: cwamu
en: [GENERAL_NOUN] settle matters

source: cwanganiza
en: [GENERAL_VERB] to go across

source: cwanganizaamu
en: [GENERAL_VERB] to divide

source: cwaogya
en: [GENERAL_VERB] be cunning, crafty, sly

source: cwankuna
en: [GENERAL_VERB] to chew

source: cweka
en: [GENERAL_VERB] to break

source: cwekana
en: [GENERAL_VERB] to succumb

source: cwekanira
en: [GENERAL_NOUN] rush at joyfully

source: cwereeira
en: [GENERAL_VERB] to invent

source: cwanganisikaniza
en: [GENERAL_NOUN] cross a path

source: cacaca
en: [GENERAL_NOUN] sound made by footsteps

source: cakucaku
en: [GENERAL_NOUN] quickly

source: ceiceice
en: [GENERAL_NOUN] in total silence

source: coroko
en: [GENERAL_NOUN] soya beans

source: culeezi
en: [GENERAL_NOUN] quiet

source: cuucuucu
en: [GENERAL_NOUN] too much smell

source: daata
en: [GENERAL_VERB] to walk majestically

source: dai
en: [GENERAL_NOUN] intensive with guma

source: kifaaro
en: [GENERAL_NOUN] slemon, devil, evil spirit

source: dakiika
en: [GENERAL_NOUN] minute
